
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>config 库 · easy-config-logic 说明文档</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="standalone.html" />
    
    
    <link rel="prev" href="standardize.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../hardware/hardware.html">
            
                <a href="../hardware/hardware.html">
            
                    
                    硬件说明
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../hardware/mztio.html">
            
                <a href="../hardware/mztio.html">
            
                    
                    逻辑插件 MZTIO
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../hardware/pixie16.html">
            
                <a href="../hardware/pixie16.html">
            
                    
                    获取插件 pixie16
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../hardware/combine.html">
            
                <a href="../hardware/combine.html">
            
                    
                    结合使用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../user-guide/user-guide.html">
            
                <a href="../user-guide/user-guide.html">
            
                    
                    使用说明
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../user-guide/quick-start.html">
            
                <a href="../user-guide/quick-start.html">
            
                    
                    快速开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../user-guide/config-syntax.html">
            
                <a href="../user-guide/config-syntax.html">
            
                    
                    配置语法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../user-guide/config-examples.html">
            
                <a href="../user-guide/config-examples.html">
            
                    
                    配置示例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../user-guide/advanced.html">
            
                <a href="../user-guide/advanced.html">
            
                    
                    进阶使用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="developer.html">
            
                <a href="developer.html">
            
                    
                    开发者文档
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="syntax.html">
            
                <a href="syntax.html">
            
                    
                    syntax 库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="standardize.html">
            
                <a href="standardize.html">
            
                    
                    standardize 库
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.3" data-path="config.html">
            
                <a href="config.html">
            
                    
                    config 库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="standalone.html">
            
                <a href="standalone.html">
            
                    
                    standalone
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >config 库</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="config-&#x5E93;"><a name="config-&#x5E93;" class="plugin-anchor" href="#config-&#x5E93;"><i class="fa fa-link" aria-hidden="true"></i></a>config &#x5E93;</h1>
<p>&#x4E0D;&#x96BE;&#x53D1;&#x73B0;&#xFF0C;&#x968F;&#x7740;&#x5F80;&#x540E;&#x63A8;&#x8FDB;&#xFF0C;&#x5C31;&#x8D8A;&#x9760;&#x8FD1;&#x786C;&#x4EF6;&#xFF0C;&#x529F;&#x80FD;&#x5C31;&#x8D8A;&#x7279;&#x5316;&#x3002;<code>config</code> &#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x6839;&#x636E;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x914D;&#x7F6E; FPGA&#xFF0C;&#x6240;&#x4EE5;&#x65E2;&#x6709;&#x62BD;&#x8C61;&#x7684;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x70B9;&#x786C;&#x4EF6;&#x7EC6;&#x8282;&#x3002;&#x8BE5;&#x5E93;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684; <code>LogicParser</code>&#xFF0C;&#x548C;&#x7528;&#x4E8E;&#x914D;&#x7F6E; FPGA &#x7684; <code>MemoryConfig</code> &#x3002;<code>LogicParser</code> &#x4F1A;&#x5BF9;&#x539F;&#x6765;&#x7684;&#x7EAF;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x62D3;&#x5C55;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x8BBE;&#x7F6E;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3001;&#x903B;&#x8F91;&#x3001;&#x5206;&#x9664;&#x3001;&#x5B9A;&#x6807;&#x5668;&#x76D1;&#x89C6;&#x7684;&#x9700;&#x6C42;&#x3002;<code>MemoryConfig</code>&#x5C31;&#x662F;&#x7EAF;&#x7CB9;&#x7684;&#x8BBE;&#x7F6E; FPGA &#x5185;&#x5B58;&#x4E86;&#xFF0C;&#x662F;&#x975E;&#x5E38;&#x67AF;&#x71E5;&#x91CD;&#x590D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4E0D;&#x4E86;&#x89E3; FPGA &#x4E2D;&#x7684;&#x5185;&#x5B58;&#x7EC6;&#x8282;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x91CC;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="logicparser"><a name="logicparser" class="plugin-anchor" href="#logicparser"><i class="fa fa-link" aria-hidden="true"></i></a>LogicParser</h2>
<p>&#x5B9A;&#x4E49;&#x548C;&#x5B9E;&#x73B0;&#x5728; <code>include/config/logic_parser.h</code> &#x548C; <code>src/config/logic_parser.cpp</code></p>
<p>&#x524D;&#x9762;&#x63D0;&#x5230;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x5C31;&#x662F;&#x7528;&#x6765;&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#xFF0C;&#x800C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x8BED;&#x6CD5;&#x5728;<a href="../user-guide/config-syntax.html">&#x914D;&#x7F6E;&#x8BED;&#x6CD5;</a>&#x4E00;&#x8282;&#x4E2D;&#x5DF2;&#x7ECF;&#x8BF4;&#x660E;&#x4E86;&#x3002;&#x914D;&#x7F6E;&#x8BED;&#x6CD5;&#x4E0E;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x5904;&#x7406;&#x7684;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#x5BF9;&#x6BD4;&#xFF0C;&#x533A;&#x522B;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x5728;&#x4E24;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x6BCF;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x53D8;&#x6210;&#x4E86;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x5DE6;&#x5F0F;&#x548C;&#x7B49;&#x4E8E;&#x53F7;</li>
<li>&#x589E;&#x52A0;&#x4E86;&#x5B9A;&#x4E49;&#x5206;&#x9664;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x4F1A;&#x5728;&#x53F3;&#x5F0F;&#x7684;&#x6700;&#x53F3;&#x8FB9;&#x589E;&#x52A0;&#x9664;&#x53F7;&#x548C;&#x4E00;&#x4E2A;&#x6570;</li>
</ul>
<p>&#x5F53;&#x7136;&#xFF0C;&#x597D;&#x6D88;&#x606F;&#x662F;&#x53BB;&#x6389;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x5957;&#x7528;&#x4E4B;&#x524D;&#x7684;&#x4EE3;&#x7801;&#x5904;&#x7406;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x60F3;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53BB;&#x6389;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x70B9;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x65B9;&#x6CD5; <code>Read</code> &#x7528;&#x6765;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x4E00;&#x884C;&#x884C;&#x8BFB;&#x53D6;&#xFF0C;&#x6240;&#x4EE5;&#x8BFB;&#x53D6;&#x540E;&#x4F7F;&#x7528;&#x65B9;&#x6CD5; <code>Parse</code> &#x6765;&#x5904;&#x7406;&#x4E00;&#x6574;&#x884C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x6240;&#x4EE5; <code>Parse</code> &#x4E5F;&#x662F;&#x5173;&#x952E;&#x4E4B;&#x5904;&#xFF0C;&#x5B83;&#x5C06;&#x5148;&#x5904;&#x7406;&#x6389;&#x548C;&#x7EAF;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x540C;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x518D;&#x7528;&#x4E4B;&#x524D;&#x7684;&#x65B9;&#x6CD5;&#x5904;&#x7406;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x4E24;&#x8005;&#x7ED3;&#x5408;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0B;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x3002;</p>
<h3 id="&#x5904;&#x7406;&#x62D3;&#x5C55;&#x8BED;&#x6CD5;"><a name="&#x5904;&#x7406;&#x62D3;&#x5C55;&#x8BED;&#x6CD5;" class="plugin-anchor" href="#&#x5904;&#x7406;&#x62D3;&#x5C55;&#x8BED;&#x6CD5;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5904;&#x7406;&#x62D3;&#x5C55;&#x8BED;&#x6CD5;</h3>
<p>&#x56E0;&#x4E3A;&#x5F15;&#x5165;&#x4E86;&#x8D4B;&#x503C;&#x548C;&#x5206;&#x9664;&#x8BED;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8BCD;&#x6CD5;&#x5206;&#x6790;&#x9636;&#x6BB5;&#x5C31;&#x8981;&#x8FDB;&#x884C;&#x62D3;&#x5C55;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x770B;&#x53F3;&#x5F0F;&#xFF0C;&#x53F3;&#x5F0F;&#x62D3;&#x5C55;&#x4E86;&#x5206;&#x9664;&#x8BED;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;<code>ExtendDividerLex</code>&#x6765;&#x5904;&#x7406;&#xFF0C;&#x57FA;&#x672C;&#x60F3;&#x6CD5;&#x5C31;&#x662F;&#x5148;&#x770B;&#x770B;&#x6709;&#x6CA1;&#x6709;&#x9664;&#x53F7;&#xFF0C;&#x6709;&#x7684;&#x8BDD;&#x5C31;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x6807;&#x793A;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x6389;&#xFF1B;&#x7136;&#x540E;&#x5BF9;&#x5269;&#x4E0B;&#x7684;&#x7EAF;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#x90E8;&#x5206;&#x7528; <code>Lexer</code> &#x5904;&#x7406;&#x3002;&#x770B;&#x5B8C;&#x4E86;&#x53F3;&#x5F0F;&#xFF0C;&#x8FD8;&#x4E0D;&#x80FD;&#x5FD8;&#x8BB0;&#x5DE6;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5728;<code>ExtendDividerLex</code> &#x5916;&#x9762;&#x53C8;&#x5305;&#x88C5;&#x4E86; <code>ExtendLeftLex</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F1A;&#x5148;&#x8C03;&#x7528; <code>LeftSideLex</code>&#x5904;&#x7406;&#x5DE6;&#x5F0F;&#x548C;&#x7B49;&#x4E8E;&#x53F7;&#xFF0C;&#x7136;&#x540E;&#x62BD;&#x51FA;&#x53F3;&#x5F0F;&#x4F20;&#x9012;&#x7ED9;<code>ExtendDividerLex</code>&#x3002;&#x5982;&#x6B64;&#x5373;&#x5B8C;&#x6210;&#x4E86;&#x62D3;&#x5C55;&#x8BED;&#x53E5;&#x7684;&#x8BCD;&#x6CD5;&#x5206;&#x6790;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x8BED;&#x6CD5;&#x5206;&#x6790;&#xFF0C;&#x56E0;&#x4E3A;&#x9664;&#x4E86;&#x5E38;&#x89C4;&#x7684;&#x6216;&#x95E8;&#x548C;&#x4E0E;&#x95E8;&#x5916;&#xFF0C;&#x8FD8;&#x8981;&#x5904;&#x7406;&#x5206;&#x9664;&#x540E;&#x7684;&#x4E0E;&#x6216;&#xFF1B;&#x524D;&#x9762;&#x7684;&#x914D;&#x7F6E;&#x8BED;&#x6CD5;&#x4E5F;&#x63D0;&#x5230;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x53F3;&#x5F0F;&#x6709;&#x5206;&#x9664;&#xFF0C;&#x5FC5;&#x987B;&#x4F5C;&#x4E3A;&#x53F3;&#x5F0F;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5728; FPGA &#x7684;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x5206;&#x9664;&#x7ED3;&#x679C;&#x548C;&#x5176;&#x4ED6;&#x4E1C;&#x897F;&#x7684;&#x4E0E;&#x6216;&#x4F7F;&#x7528;&#x7684;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x6211;&#x4E00;&#x822C;&#x79F0;&#x4E4B;&#x4E3A;&#x5206;&#x9664;&#x95E8;&#xFF0C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x7684;&#x4E0E;&#x95E8;&#x548C;&#x6216;&#x95E8;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x65B9;&#x6CD5; <code>ExtendDividerParse</code> &#x6765;&#x5904;&#x7406;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;</p>
<ul>
<li>&#x5BF9;&#x8868;&#x8FBE;&#x5F0F;&#x8FDB;&#x884C;&#x8BED;&#x6CD5;&#x68C0;&#x67E5;&#xFF0C;&#x68C0;&#x67E5;&#x901A;&#x8FC7;&#x540E;&#x5F00;&#x59CB;&#x89E3;&#x6790;&#x8868;&#x8FBE;&#x5F0F;</li>
<li>&#x68C0;&#x67E5;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x4E86;&#x5206;&#x9664;&#xFF0C;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x5C31;&#x5148;&#x8DF3;&#x8FC7;</li>
<li>&#x89E3;&#x6790;&#x4E0D;&#x5305;&#x542B;&#x5206;&#x9664;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x8C03;&#x7528; <code>SLRSyntaxParser::Parse</code> &#x6765;&#x5904;&#x7406;</li>
<li>&#x6807;&#x51C6;&#x5316;&#x8868;&#x8FBE;&#x5F0F;</li>
<li>&#x6839;&#x636E;&#x6807;&#x51C6;&#x5F62;&#x5F0F;&#x7684;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#x8BB0;&#x5F55;&#x8981;&#x751F;&#x6210;&#x7684;&#x4E0E;&#x95E8;&#x548C;&#x6216;&#x95E8;&#xFF0C;&#x6216;&#x8005;&#x751F;&#x6210;&#x65F6;&#x949F;&#xFF0C;&#x901A;&#x8FC7;&#x8C03;&#x7528; <code>GenerateGates</code> &#x5904;&#x7406;</li>
<li>&#x91CD;&#x65B0;&#x5904;&#x7406;&#x5206;&#x9664;&#x95E8;&#xFF0C;&#x8C03;&#x7528; <code>GenerateDividerGate</code> &#x5B9E;&#x73B0;</li>
</ul>
<h4 id="&#x8BED;&#x6CD5;&#x68C0;&#x67E5;"><a name="&#x8BED;&#x6CD5;&#x68C0;&#x67E5;" class="plugin-anchor" href="#&#x8BED;&#x6CD5;&#x68C0;&#x67E5;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x8BED;&#x6CD5;&#x68C0;&#x67E5;</h4>
<p>&#x4E0A;&#x8FF0; <code>ExtendDividerParse</code> &#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x8BED;&#x6CD5;&#x68C0;&#x67E5;&#xFF0C;&#x5305;&#x62EC;&#x53D8;&#x91CF;&#x540D;&#x68C0;&#x67E5;&#x548C;&#x51B2;&#x7A81;&#x68C0;&#x67E5;&#x4E24;&#x90E8;&#x5206;&#x3002;&#x56E0;&#x4E3A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x8BED;&#x6CD5;&#x56FA;&#x5B9A;&#x4E86;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x53D8;&#x91CF;&#x540D;&#x68C0;&#x67E5;&#x5305;&#x62EC;</p>
<ul>
<li>&#x53D8;&#x91CF;&#x540D;&#x662F;&#x5426;&#x7B26;&#x5408;&#x8BED;&#x6CD5;&#x8981;&#x6C42;</li>
<li>&#x8BE5;&#x53D8;&#x91CF;&#x80FD;&#x5426;&#x5728;&#x5DE6;&#x5F0F;&#x6216;&#x8005;&#x53F3;&#x5F0F;&#x51FA;&#x73B0;</li>
<li>&#x5DE6;&#x5F0F;&#x548C;&#x53F3;&#x5F0F;&#x7684;&#x7EC4;&#x5408;&#x662F;&#x5426;&#x6709;&#x610F;&#x4E49;&#x3002;</li>
</ul>
<p>&#x51B2;&#x7A81;&#x68C0;&#x67E5;&#x4F1A;&#x68C0;&#x67E5;</p>
<ul>
<li>&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x8BBE;&#x7F6E;&#x4E86;&#x591A;&#x4E2A;&#x8F93;&#x51FA;&#x6765;&#x6E90;</li>
<li>&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x540C;&#x65F6;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7AEF;</li>
<li>&#x4E00;&#x4E2A;&#x524D;&#x9762;&#x677F;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x540C;&#x65F6;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x7F51;&#x53E3;&#x548C; LEMO &#x53E3;&#x8F93;&#x5165;&#x6216;&#x8005;&#x8F93;&#x51FA;</li>
<li>&#x4E00;&#x4E2A;&#x5B9A;&#x6807;&#x5668;&#x662F;&#x5426;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x76D1;&#x89C6;&#x591A;&#x4E2A;&#x4FE1;&#x53F7;</li>
<li>&#x4F7F;&#x7528;&#x5206;&#x9664;&#x524D;&#x662F;&#x5426;&#x5BF9;&#x5176;&#x5B9A;&#x4E49;</li>
</ul>
<h4 id="&#x751F;&#x6210;&#x95E8;"><a name="&#x751F;&#x6210;&#x95E8;" class="plugin-anchor" href="#&#x751F;&#x6210;&#x95E8;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x751F;&#x6210;&#x95E8;</h4>
<p><code>GenerateGates</code> &#x548C; <code>GenerateDividerGate</code> &#x53EF;&#x80FD;&#x4F1A;&#x4EE4;&#x4EBA;&#x7A0D;&#x8BB8;&#x8FF7;&#x60D1;&#xFF0C;&#x56E0;&#x4E3A;&#x6807;&#x51C6;&#x5F62;&#x5F0F;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5B9E;&#x9645;&#x4E0A;&#x5DF2;&#x7ECF;&#x9690;&#x542B;&#x4E86;&#x4E0E;&#x95E8;&#x548C;&#x6216;&#x95E8;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x65B0;&#x7684;&#x95E8;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x63D0;&#x53D6;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x5173;&#x4E8E;&#x4E0E;&#x95E8;&#x548C;&#x6216;&#x95E8;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x7504;&#x522B;&#x591A;&#x884C;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;&#x91CD;&#x590D;&#x7684;&#x95E8;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x95E8;&#x8BB0;&#x5F55;&#x6210;&#x66F4;&#x8D34;&#x8FD1; FPGA &#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;&#x95E8;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x8FD9;&#x91CC;&#x8BB0;&#x5F55;&#x7684;&#x95E8;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4EE3;&#x8868;&#x53D8;&#x91CF;&#x548C;&#x5176;&#x4ED6;&#x95E8;&#x7684;&#x5E8F;&#x53F7;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x8868;&#x8FBE;&#x5F0F; A0 &amp; A1&#xFF0C;&#x4EA7;&#x751F;&#x7684;&#x4E0E;&#x95E8;&#x4F1A;&#x8BB0;&#x5F55;&#x4E0B;&#x4FE1;&#x606F;0&#x548C;1&#xFF0C;&#x7528;&#x6765;&#x8868;&#x793A; A0 &#x548C; A1&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BF4;&#x662F;&#x66F4;&#x8D34;&#x8FD1; FPGA &#x4E2D;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x8FD9;&#x6BB5;&#x5199;&#x7684;&#x6709;&#x70B9;&#x4E71;&#xFF0C;&#x770B;&#x4E0D;&#x61C2;&#x7684;&#x8FD8;&#x662F;&#x770B;&#x4EE3;&#x7801;&#x5427;&#x3002;</p>
<h3 id="&#x83B7;&#x53D6;&#x7ED3;&#x679C;"><a name="&#x83B7;&#x53D6;&#x7ED3;&#x679C;" class="plugin-anchor" href="#&#x83B7;&#x53D6;&#x7ED3;&#x679C;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x83B7;&#x53D6;&#x7ED3;&#x679C;</h3>
<p>&#x89E3;&#x6790;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x3002;&#x6BD4;&#x5982;&#x8BF4; <code>OrGateSize</code> &#x83B7;&#x53D6;&#x6216;&#x95E8;&#x7684;&#x6570;&#x91CF;&#xFF0C;<code>OrGate</code> &#x83B7;&#x53D6;&#x7279;&#x5B9A;&#x6216;&#x95E8;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5177;&#x4F53;&#x89C1;&#x4EE3;&#x7801;&#x6216;&#x8005;api&#x6587;&#x6863; <a href="https://kinstaky.github.io/easy-config-logic/" target="_blank">https://kinstaky.github.io/easy-config-logic/</a> &#x3002;</p>
<h3 id="&#x5C0F;&#x7ED3;"><a name="&#x5C0F;&#x7ED3;" class="plugin-anchor" href="#&#x5C0F;&#x7ED3;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5C0F;&#x7ED3;</h3>
<p><code>LogicParser</code> &#x5C31;&#x662F;&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x5C06;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x8F6C;&#x5316;&#x6210;&#x8D34;&#x8FD1; FPGA &#x7684;&#x4E0E;&#x95E8;&#x3001;&#x6216;&#x95E8;&#x3001;&#x5206;&#x9664;&#x3001;&#x5B9A;&#x6807;&#x5668;&#x4FE1;&#x606F;&#xFF0C;&#x65B9;&#x4FBF; <code>MemoryConfig</code> &#x8BFB;&#x53D6;&#x3002;</p>
<h2 id="memoryconfig"><a name="memoryconfig" class="plugin-anchor" href="#memoryconfig"><i class="fa fa-link" aria-hidden="true"></i></a>MemoryConfig</h2>
<p>&#x5B9A;&#x4E49;&#x548C;&#x5B9E;&#x73B0;&#x5728; <code>include/config/memory_config.h</code> &#x548C; <code>src/config/memory_config.cpp</code>&#x3002;</p>
<p>&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B; <code>MemoryConfig</code> &#x5C31;&#x662F;&#x5F88;&#x67AF;&#x71E5;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3002;&#x5176;&#x5185;&#x90E8;&#x6709;&#x4E00;&#x4E2A;&#x7ED3;&#x6784; <code>Memory</code>&#xFF0C;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x548C; FPGA &#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x503C;&#xFF0C;&#x6240;&#x6709;&#x9700;&#x8981;&#x5199;&#x5230; FPGA &#x5185;&#x7684;&#x503C;&#x90FD;&#x4F1A;&#x4FDD;&#x5B58;&#x5728;&#x8FD9;&#x91CC;&#x9762;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x7F51;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3001;&#x6216;&#x95E8;&#x4E0E;&#x95E8;&#x7684;&#x8BBE;&#x7F6E;&#x3001;&#x65F6;&#x949F;&#x3001;&#x5206;&#x9664;&#x7B49;&#x7684;&#x8BBE;&#x7F6E;&#x3002;</p>
<p><code>MemoryConfig</code> &#x6709;&#x4E24;&#x4E2A; <code>Read</code> &#x51FD;&#x6570;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE; <code>LogicParser</code> &#x6216;&#x8005;&#x4F4E;&#x7EA7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x3002;&#x6709;&#x4E00;&#x4E2A; <code>Write</code> &#x51FD;&#x6570;&#x7528;&#x4E8E;&#x5199;&#x4F4E;&#x7EA7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x8FD8;&#x6709;&#x8F93;&#x51FA;&#x6D41; <code>operator&lt;&lt;</code> &#x7528;&#x4E8E;&#x5C06;&#x5185;&#x5B58;&#x5185;&#x5BB9;&#x6253;&#x5370;&#x5230;&#x5C4F;&#x5E55;&#x4E2D;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x8981;&#x7528;&#x4E8E;&#x8BBE;&#x7F6E; FPGA&#xFF0C;&#x6211;&#x8BBE;&#x7F6E;&#x4E86;&#x51FD;&#x6570; <code>MapMemory</code> &#x5C06;&#x4FDD;&#x5B58;&#x7684;&#x8BBE;&#x7F6E;&#x5199;&#x5165;&#x5230; FPGA&#xFF08;&#x56E0;&#x4E3A;&#x8FD9;&#x4E86;&#x4F7F;&#x7528;&#x5230; <a href="http://xillybus.com/xillybus-lite" target="_blank">xillybuslite</a>&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4F9D;&#x9760;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x76F4;&#x63A5;&#x628A;&#x8BBE;&#x7F6E;&#x5199;&#x5165;&#x5230; FPGA&#x4E2D;&#xFF09;&#x3002;&#x540E;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>GetMemory</code> &#x5F97;&#x5230;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x6307;&#x5411;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x4F53; <code>Memory</code> &#x7684;&#x6307;&#x9488;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x53EA;&#x6709; <code>ConvertSource</code> &#x53EF;&#x80FD;&#x4EE4;&#x4EBA;&#x7565;&#x5FAE;&#x8FF7;&#x60D1;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5728; <code>LogicParser</code> &#x4E2D;&#x5BF9;&#x4E0D;&#x540C;&#x4FE1;&#x53F7;&#x7684;&#x5E8F;&#x53F7;&#x8BBE;&#x7F6E;&#x548C; FPGA &#x4E2D;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x4ECE; <code>LogicParser</code> &#x4E2D;&#x8BFB;&#x53D6;&#x8BBE;&#x7F6E;&#x65F6;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#xFF0C;&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x90FD;&#x662F;&#x91CD;&#x590D;&#x52B3;&#x52A8;&#xFF0C;&#x6CA1;&#x5565;&#x53EF;&#x4EE5;&#x7EC6;&#x8BF4;&#x7684;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;"><a name="&#x603B;&#x7ED3;" class="plugin-anchor" href="#&#x603B;&#x7ED3;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x603B;&#x7ED3;</h2>
<p><code>config</code> &#x5E93;&#x5206;&#x4E3A;&#x4E86;&#x4E24;&#x90E8;&#x5206;&#xFF0C;<code>LogicParser</code> &#x7528;&#x6765;&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x89E3;&#x6790;&#x5176;&#x4E2D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5E76;&#x8F6C;&#x6362;&#x6210;&#x4E2D;&#x95F4;&#x6570;&#x636E;&#xFF0C;<code>MemoryConfig</code>&#x5219;&#x662F;&#x5C06;&#x4E2D;&#x95F4;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x6210;&#x548C; FPGA &#x5185;&#x5B58;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x6620;&#x5C04;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x8BFB;/&#x5199;&#x4F4E;&#x7EA7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x5F53;&#x7136;&#xFF0C;<code>MemoryConfig</code> &#x4E2D;&#x7684; <code>Memory</code> &#x5176;&#x5B9E;&#x4E0D;&#x5B8C;&#x5168;&#x548C; FPGA &#x7684;&#x5185;&#x5B58;&#x5BF9;&#x5E94;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6539;&#x8FDB;&#x7A7A;&#x95F4;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="standardize.html" class="navigation navigation-prev " aria-label="Previous page: standardize 库">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="standalone.html" class="navigation navigation-next " aria-label="Next page: standalone">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"config 库","level":"1.4.3","depth":2,"next":{"title":"standalone","level":"1.4.4","depth":2,"path":"developer/standalone.md","ref":"developer/standalone.md","articles":[]},"previous":{"title":"standardize 库","level":"1.4.2","depth":2,"path":"developer/standardize.md","ref":"developer/standardize.md","articles":[]},"dir":"ltr"},"config":{"plugins":["anchors","code","splitter","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"easy-config-logic 说明文档","gitbook":"*","description":"easy-config-logic 项目的使用和开发说明"},"file":{"path":"developer/config.md","mtime":"2022-08-18T08:57:32.605Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-08-18T09:03:09.578Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

